import { useEffect} from "react";
export default function Footer() {
  useEffect(()=>{
    window.scrollTo(0, 0);
  })
  return (
    <div className="EndQuran">
      <div className="container">
        <div className="box">
          <h3 className="title-ayah">دعاء ختم القرآن الكريم</h3>
        </div>
        <div className="EndQuran">
          <h4 className="descriptionChange">
            عند إتمام المسلم لقراءة القرآن الكريم، سواء كان ذلك عن طريق الحفظ،
            التلاوة، أو القراءة بشكل خاص، توجد مجموعة من الأدعية يمكن أن يرددها
            هذه الأدعية التي تعبر عن توجه النفس نحو الله طلبًا للخير والبركات.
            إليكم بعض الأجزاء المختارة من هذا الدعاء:
          </h4>
          <ul>
            <li>اللهم ارحمني بالقرآن واجعله لي إمامًا ونورًا وهدى ورحمة.</li>
            <li>
              للهم ذكرنا منه ما نسينا، وعلمنا منه ما جهلنا، وارزقنا تلاوته آناء
              الليل وأطراف النهار على الوجه الذى يرضيك عنا، اللهم اجعلنا مما يحل
              حلاله ويحرم حرامه، ويعمل بمحكمه، ويؤمن بمتشابهه، ويتلوه حق تلاوته.
            </li>
            <li>
              اللهم أصلح لي ديني الذي هو عصمة أمري وأصلح لي دنياي التي فيها
              معاشي وأصلح لي آخرتي التي فيها معادي وأجعل الحياة زيادة لي في كل
              خير وأجعل الموت راحة لي من كل شر.
            </li>
            <li>
              اللهم اجعل خير عمري آخره وخير عملي خواتمه وخير أيامي يوم ألقاك
              فيه.
            </li>
            <li>
              اللهم إني أسألك عيشة هنية وميتة سوية ومرادا غير مخز ولا فاضح.
            </li>
            <li>
              اللهم إنى أسألك خير المسألة وخير الدعاء وخير النجاح وخير العلم
              وخير العمل وخير الثواب وخير الحياة وخير الممات وثبتنى وثقل موازيني
              وحقق إيماني وارفع درجتي وتقبل صلاتي واغفر خطيئاتي وأسألك العلا من
              الجنة .
            </li>
            <li>
              اللهم إني أسألك موجبات رحمتك وعزائم مغفرتك والسلامة من كل إثم
              والغنيمة من كل بر والفوز بالجنة والنجاة من النار .
            </li>
            <li>
              اللهم أحسن عاقبتنا في الأمور كلها، وأجرنا من خزي الدنيا وعذاب
              الآخرة .
            </li>
            <li>
              اللهم اقسم لنا من خشيتك ماتحول به بيننا وبين معصيتك ومن طاعتك
              ماتبلغنا بها جنتك ومن اليقين ماتهون به علينا مصائب الدنيا ومتعنا
              بأسماعنا وأبصارنا وقوتنا ماأحييتنا واجعله الوارث منا واجعل ثأرنا
              على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا ولا
              تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا تسلط علينا من لا يرحمنا .
            </li>
            <li>
              اللهم لا تدع لنا ذنبا إلا غفرته ولا هما إلا فرجته ولا دينا إلا
              قضيته ولا حاجة من حوائج الدنيا والآخرة إلا قضيتها يا أرحم
              الراحمين.
            </li>
            <li>
              اللهم لك الحمد على أن رزقتني فهم القرآن الكريم، فاللهم ارزقني
              تعليمه للآخرين.
            </li>
            <li>
              ربِ كما علمتني تلاوته علمني حفظه واجعله نورًا في قلبي وفي صدري.
            </li>
            <li>
              اللهم اجعلني ممن جعلتهم يعملون بالقرآن الكريم وما حفظوه، اللهم
              اجعل القرآن حجة لنا ولا تجعله حجة علينا، واجعله شفيعا لنا يوم
              القيامة.
            </li>
            <li>اللهم ارحمني بالقرآن واجعله لي إماما ونورا وهدى ورحمة.</li>
            <li>
              ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار وصلى الله
              على سيدنا ونبينا محمد وعلى آله وأصحابه الأخيار وسلم تسليما كثيرا.
            </li>
            <li>
              اللهم صل على محمد، وعلى آل محمد، كما صليت على آل إبراهيم، وبارك
              على محمد، وعلى آل محمد، كما باركت على آل إبراهيم في العالمين إنك
              حميد مجيد
            </li>
          </ul>
        </div>
      </div>
    </div>
  );
}
