export const getJuzLabel = (juz_number) => {
    return juz_number === 1 ? "الجزء الأول" :
           juz_number === 2 ? "الجزء الثاني" :
           juz_number === 3 ? "الجزء الثالث" :
           juz_number === 4 ? "الجزء الرابع" :
           juz_number === 5 ? "الجزء الخامس" :
           juz_number === 6 ? "الجزء السادس" :
           juz_number === 7 ? "الجزء السابع" :
           juz_number === 8 ? "الجزء الثامن" :
           juz_number === 9 ? "الجزء التاسع" :
           juz_number === 10 ? "الجزء العاشر" :
           juz_number === 11 ? "الجزء الحادي عشر" :
           juz_number === 12 ? "الجزء الثاني عشر" :
           juz_number === 13 ? "الجزء الثالث عشر" :
           juz_number === 14 ? "الجزء الرابع عشر" :
           juz_number === 15 ? "الجزء الخامس عشر" :
           juz_number === 16 ? "الجزء السادس عشر" :
           juz_number === 17 ? "الجزء السابع عشر" :
           juz_number === 18 ? "الجزء الثامن عشر" :
           juz_number === 19 ? "الجزء التاسع عشر" :
           juz_number === 20 ? "الجزء العشرون" :
           juz_number === 21 ? "الجزء الحادي والعشرون" :
           juz_number === 22 ? "الجزء الثاني والعشرون" :
           juz_number === 23 ? "الجزء الثالث والعشرون" :
           juz_number === 24 ? "الجزء الرابع والعشرون" :
           juz_number === 25 ? "الجزء الخامس والعشرون" :
           juz_number === 26 ? "الجزء السادس والعشرون" :
           juz_number === 27 ? "الجزء السابع والعشرون" :
           juz_number === 28 ? "الجزء الثامن والعشرون" :
           juz_number === 29 ? "الجزء التاسع والعشرون" :
           juz_number === 30 ? "الجزء الثلاثون" :
           juz_number; // افتراضي
  };